{"timestamp": "2025-07-21T16:29:32.829Z", "content": "Throughout the past century, there has been a clear shift in the way economic markets have operated. The proliferation of the exchange of digital information via channels such as the internet have given rise to new types of markets, where products and services are exchanged for zero monetary cost, and where revenue is generated through secondary means such as advertising. Today, very few large companies control the majority of these platforms, raising major antitrust concerns that are unable to be properly addressed by previous antitrust legislation. Previous antitrust legislation, designed to combat monopolies, predatory pricing, and other market failures, are unfit to properly address concerns over non-monetary costs of this new digital age. The costs of misinformation and data privacy are all borne by the consumers, yet are not quantified nor addressed by this legislation. This raises the question, how can we regulate the monopolistic control of data, and with that, what criteria must be considered for such legislation.Some economists and legal philosophies argue that zero-price markets require new models focused on privacy and data value, unlike traditional price-based approaches. Conversely, some believe that new regulation is not necessary, since these markets typically use secondary sources of revenue such as advertising. Although the costs incurred on the consumer are not monetary, the data and information given to the companies in exchange for access to these platforms does carry a value, exemplified by the practice of selling data to advertisers. In order to maintain efficient outcomes, these costs incurred must be considered when regulating these markets not only for market efficiency, but also for consumer welfare. Furthermore, concerns over widespread misinformation which is possible through these monopolistic platforms have arisen. Consumers bear a cost not only when accessing these sites, but their continued usage can expose them to misinformation, which can adversely affect their choices in all aspects of life. The risk of misinformation, and its associated costs, must be mitigated by future antitrust legislation.Existing legislation, designed for markets with costs extending not far past monetary ones, lack the scope and capabilities of dealing with zero-price markets. Consumer welfare and market efficiency are being affected by an increasing number of novel factors, and at an even greater scale as even lesser-developed countries are readily able to access the internet. These concerns have already begun to realize themselves through large scale data breaches and widespread misinformation. As these problems grow in magnitude and in reach, regulators must be prepared to combat these.", "event": "DONE_CLICKED"}
