{"timestamp": "2025-06-17T15:03:13.188Z", "content": "Conventionally, markets that are regulated by anti-trust laws are things like steel, oil, natural gas, etc. These markets have prices attached to their products--people pay for these goods or services. However, in the age of technology, there have been an increasing number of zero-price markets. The companies within these markets are typically giants like Google, Meta, and Amazon. These companies provide their services ostensibly for free but monetize through data collection and targeted advertising. While some proponents of the digital age argue that these markets need not be regulated, the data suggests otherwise, indicating that tech giants control the vast majority of these market spaces.Recently, in 2024, the DOJ investigated Google, and found that Google controlled over 85% of the search market, which stifles competition and innovation within the market. This dominance not only affects other businesses trying to enter the search engine industry but also limits consumer choices and potentially biases the information they receive. Lack of regulation in these market spaces is so dangerous because of the ubiquity of technology in the 21st century. Not only is technological progress retarded due to lack of competition, but the media and information we receive in not always the most accurate. Instead, the information we receive from social media and the Internet in general is geared toward what will produce the most ad revenue for these profit-driven companies. Media that is outrageous, inflammatory, polarizing, and divisive will be recommended to people by complicated algorithms because it keeps users engaged longer, even if it's at the expense of presenting balanced, factual news.Another problematic aspect of these zero-profit industries is the fact that they do not take consumer well-being into account. In fact, they deliberately ignore the negative impacts their entertainment services have on consumers to maximize revenue. Platforms like YouTube, Instagram, and TikTok have been shown to increase levels of depression and anxiety. A 2018 study by the Royal Society for Public Health in the UK found that Instagram, Facebook, and Twitter have negative impacts on mental health, with Instagram being the worst due to increased anxiety and depression (Royal Society for Public Health). Even though the scientific evidence is clear, big moneyed interests from Silicon Valley to the Capitol refuse to regulate these corporations. People who consume these addictive and damaging services are suffering so that tech giants might turn a greater profit off of their data and ad revenue.", "event": "DONE_CLICKED"}
