{"timestamp": "2025-06-17T14:19:30.315Z", "content": "Zero-price antitrust markets still need regulation. Although consumers do not pay a \"price\" for these services, they do pay with other things. They may pay with their time, peace of mind, and mental health. Studies show that use of social media, a zero-price market, can often lead to increased anxiety and depression among teenagers. This is problematic because these zero-price industries still can capitalize off these people, especially young people. Zero-price markets are still turning a vast, massive profit despite not having a physical, monetary price on their services.\n\nServices like YouTube, Instagram, and TikTok are making large profits off of ad revenue because they are paid by advertisers based on consumer engagement with their platform. This means that there is a financial incentive to make their platforms as addicting for people as possible. They do NOT have their consumers' best interest in mind. Rather, they seek to maximize their profits by engineering their algorithms to be as addicting as possible.\n\nWith YouTube for example, they engineered the algorithm to recommend people shorter and shorter videos as you get later into the night. This is because people are more likely to click and watch a video that is shorter in length when it gets late at night. People are generally unlikely to watch a really long video at 1 AM because they'd rather go to bed. This is unhealthy for the consumer and greedy on part of the corporation because they are profiting off the consumer staying on their platform for longer and losing sleep. With each video on YouTube, YouTube makes a profit when it is played because there are ads at the beginning and sometimes throughout the video.\n\nAnother example is with TikTok. The engineers that work on TikTok intentionally make the algorithm as addicting as possible. They use complicated algorithms to recommend videos on your feed that people are more likely to engage with. This allows them to stay on their platform for a longer and longer period of time.\n\nIt is clear that through the usage of these algorithms that these zero-price markets should be very regulated because of how they may abuse an unregulated market to maximize profits and hurt consumers.", "event": "NEXT_CLICKED"}
