{"timestamp": "2025-06-16T15:42:38.646Z", "content": "Traditionally, antitrust laws have been used to break up monopolies (industries where one company or figure has control over the whole industry). Because these monopolies face no competitors, there is no alternative that customers can turn to if they are dissatisfied with the monopolies' policies or prices. This allows monopolies to hike up prices greatly, with customers having no choice but to pay. These monopolies are especially damaging in industries with products that are important to customers, such as the pharmaceutical industry. Customers rely on the medicine for survival and care, and must pay whatever price the company demands. Antitrust laws were established by the government in order to prevent companies from forming monopolies or mergers (where two companies decide to join as one) so they can no longer control the prices as before. These laws were formed using market analysis, where analysts look at the prices in the market of the industry and thus create corresponding laws. \n\nHowever, new \"zero-price markets\" are being formed as a result of social media and increased technology. Inside zero-price markets, companies offer goods or services for free, such as financial advice, tools that can help create websites, and more. Some examples of zero-price markets are software, social media, and travel booking. Because these markets don't charge any fees towards users, old anti-trust laws have difficulty addressing them since there is no market analysis involving prices that they can use. As a result, decisions that occur in zero-price market can occur at harm to users by not taking into their account. For instance, the deregulation of the radio industry- radio is considered a zero-price market because users don't need to pay to listen to the radio - resulted in mergers between radio stations(?), and could have had negative impacts on listeners. There are different opinions on the role of zero-price markets in anti-trust laws. One side says that zero-price markets should be considered in antitrust discussions, since they involve costs that signal market behavior. Zero-price markets can influence customers to certain actions that affect non-zero-price markets, like a free software leading users to pivot away from services they must pay for, or influencers on social media encouraging users to visit a certain country or tourist attraction. Others believe that because zero-price markets don't use prices to attract customers but rather use other revenue models like advertising, the risk that they pose is lower than traditional markets, and consumer welfare is maintained through these different mechanisms. \n\nThe question of zero-price markets regarding anti-trust laws should be split into two different questions - for one, anti-trust laws specifically on zero-price markets, and two, anti-trust laws regarding traditional markets that zero-price markets may affect. For the first question, the second argument more aptly applies as zero-price markets don't use actual prices and will maintain consumer welfare through different ways. One could also raise the point that because the market in question doesn't charge it's consumers, there will be other companies and producers that can offer the same type of good for free, thus reducing the need for anti-trust laws because there will normally be other competitors in the market. We can see this in social media, where there are countless influencers focused on different topics, ranging from skincare to investing to internship advice. For the second question, it is doubtless that zero-price markets may have an effect on traditional markets. However, this effect may be hard to quantify, and researchers and market analysts must come up with ways to deal with those scenarios.", "event": "NEXT_CLICKED"}
