{"timestamp": "2025-06-17T18:28:51.398Z", "content": "Corporate personhood -- the concept that corporations can be treated as singular entities separate from any body subsumed within them -- is, to me, an illogical opinion that has done harm to the United States and its democratic system. One of the most significant harms done by corporate personhood is in the Citizens United case, as mentioned in the background information -- that Supreme Court decision is based on the idea that corporations should be allowed to have a voice and therefore to spend unlimited money on political matters, within some restrictions. This reveals the flaw at the core of the concept of corporate personhood, which is quite obvious: there is a distinct difference between a corporation and a person. People are generally not allowed to spend unlimited amounts of money on campaigns and political action committees, I believe, but even if they could there is no one person that could donate the amount of money or have the interests that a corporation has. For example, humans have temporary lifetimes and corporations can sometimes live for many generations of humans, so the thinking of a corporation in preserving its long-term success will be entirely different from the thinking of a human being who also has a stake in a political issue. In addition, corporations don't have emotions. Humans might be swayed to vote or support a campaign/cause because they feel a certain way about some issue ethically, but corporations largely exist without those barriers and they can funnel untold amounts of money through to campaigns solely considering their own bottom line; the nature of a corporation as an entity consisting of many human beings working to advance the prospects of that one entity removes a lot of the personal feeling tied to being human. Groupthink is a real phenomenon, and groups often lose empathy; I still believe that every individual or even perhaps a group of individuals have free speech, but claiming that the shell of a corporation separate from the individuals who make it tick has free speech is absurd and harmful to me. I understand the argument that corporate personhood also allows for accountability of corporations -- that companies can be sued or held liable for damages because of the concept of personhood. I know that this is likely necessary, especially in an era of technology where the human developers behind that tech are becoming more and more removed from the technology itself: for example, in a self-driving car crash, is the company at fault? Or the developers who coded it? Or the car manufacturer? But regardless, I do not believe that holding corporations to account should be correlated with corporate personhood -- when it's difficult to pin blame onto one person or a group of people, it makes sense to punish the company because that's the broadest entity that's fully culpable. However, to me, this logic does not apply to concepts like corporations having \"free speech\". I also believe that the concept of punishing companies is nebulous and can lead to adverse consequences (e.g. a company only getting a tiny fine for causing deaths or other harm, instead of individual people being punished and forcing a company to change its policies, which can inadvertently encourage companies to continue their harmful behavior if it makes them more profit than punishment). Overall, I believe that humans have rights and voting power and free speech and inalienable rights, and corporations as entities that are both made up of groups of humans and also distinct from those groups do not have those same rights.", "event": "DONE_CLICKED"}
